In [4]:
#3 functions = apply, applyname and map
employee = {
    'id':[1, 2, 3],
    'name':['Nitin', 'Gautam', 'Ramesh'],
    'email':['a@x.com', 'b@x.com', 'c@x.com']   
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(employee)

In [4]:
df.columns

Index(['id', 'name', 'email'], dtype='object')

In [5]:
df.columns = ['id', 'full_name', 'user_email']

In [6]:
df.columns

Index(['id', 'full_name', 'user_email'], dtype='object')

In [7]:
df

   id full_name user_email
0   1     Nitin    a@x.com
1   2    Gautam    b@x.com
2   3    Ramesh    c@x.com

In [8]:
df.columns = [x.upper() for x in df.columns]

In [9]:
df

   ID FULL_NAME USER_EMAIL
0   1     Nitin    a@x.com
1   2    Gautam    b@x.com
2   3    Ramesh    c@x.com

In [10]:
df.columns = df.columns.str.replace('_', '-')

In [11]:
df

   ID FULL-NAME USER-EMAIL
0   1     Nitin    a@x.com
1   2    Gautam    b@x.com
2   3    Ramesh    c@x.com

In [12]:
df.columns = df.columns.str.replace('-', '_')

In [13]:
df

   ID FULL_NAME USER_EMAIL
0   1     Nitin    a@x.com
1   2    Gautam    b@x.com
2   3    Ramesh    c@x.com

In [15]:
df.columns = [x.lower() for x in df.columns]

In [16]:
df

   id full_name user_email
0   1     Nitin    a@x.com
1   2    Gautam    b@x.com
2   3    Ramesh    c@x.com

In [17]:
df.rename(columns={'full_name':'name', 'user_email':'email'})

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3  Ramesh  c@x.com

In [18]:
df

   id full_name user_email
0   1     Nitin    a@x.com
1   2    Gautam    b@x.com
2   3    Ramesh    c@x.com

In [19]:
df.rename(columns={'full_name':'name', 'user_email':'email'}, inplace=True)

In [20]:
df

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3  Ramesh  c@x.com

In [21]:
df.loc[2]

id             3
name      Ramesh
email    c@x.com
Name: 2, dtype: object

In [22]:
df.loc[2]=[3, 'Hirendra', 'h@x.com']

In [23]:
df

   id      name    email
0   1     Nitin  a@x.com
1   2    Gautam  b@x.com
2   3  Hirendra  h@x.com

In [25]:
df.loc[2, ['name', 'email']]

name     Hirendra
email     h@x.com
Name: 2, dtype: object

In [26]:
df.loc[2, ['name', 'email']] = ['Sachin' , 's@x.com']

In [27]:
df

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3  Sachin  s@x.com

In [32]:
filt = (df['name'] == 'Sachin')

In [33]:
df[filt]

   id    name    email
2   3  Sachin  s@x.com

In [34]:
df[filt]['email']

2    s@x.com
Name: email, dtype: object

In [35]:
df[filt]['name'] = 'Nitin'

C:\Users\Nitin Gautam\AppData\Local\Temp\ipykernel_32\49886704.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['name'] = 'Nitin'

In [36]:
df

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3  Sachin  s@x.com

In [37]:
filt = (df['name'] == 'Sachin')

In [38]:
df.loc[filt, 'name'] = 'Nitin'

In [39]:
df

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3   Nitin  s@x.com

In [42]:
df['email'].str.upper()

0    A@X.COM
1    B@X.COM
2    S@X.COM
Name: email, dtype: object

In [43]:
df

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3   Nitin  s@x.com

In [44]:
df['email'] = df['email'].str.upper()

In [45]:
df

   id    name    email
0   1   Nitin  A@X.COM
1   2  Gautam  B@X.COM
2   3   Nitin  S@X.COM

In [49]:
#apply functions apply the changes to each value
df['email'].apply(len)

0    7
1    7
2    7
Name: email, dtype: int64

In [51]:
def change_case_to_lower(email):
    return email.lower()

In [53]:
df['email'] = df['email'].apply(change_case_to_lower)

In [54]:
df

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3   Nitin  s@x.com

In [55]:
df['email'] = df['email'].apply(lambda x: x.upper())

In [56]:
df

   id    name    email
0   1   Nitin  A@X.COM
1   2  Gautam  B@X.COM
2   3   Nitin  S@X.COM

In [59]:
#values in each column
df.apply(len)

id       3
name     3
email    3
dtype: int64

In [61]:
#same as above
len(df['email'])

3

In [65]:
#row 0=3 values, rows 2=3 values, etc
df.apply(len, axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [66]:
#min value of each column
df.apply(pd.Series.min)

id             1
name      Gautam
email    A@X.COM
dtype: object

In [73]:
#works for on all values
df.applymap(lambda x: len(str(x)))

   id  name  email
0   1     5      7
1   1     6      7
2   1     5      7

In [72]:
df.applymap(lambda x: (str(x).lower()))

  id    name    email
0  1   nitin  a@x.com
1  2  gautam  b@x.com
2  3   nitin  s@x.com

In [77]:
#map works for only series
df['name'].map({'Nitin':'chintu'})

0    chintu
1       NaN
2    chintu
Name: name, dtype: object

In [76]:
df

   id    name    email
0   1   Nitin  A@X.COM
1   2  Gautam  B@X.COM
2   3   Nitin  S@X.COM

In [78]:
df['name'] = df['name'].map({'Nitin':'chintu'})

In [79]:
df

   id    name    email
0   1  chintu  A@X.COM
1   2     NaN  B@X.COM
2   3  chintu  S@X.COM

In [84]:
df = pd.read_csv('stack-overflow-data/survey_results_public.csv', index_col='Respondent')

In [85]:
df.head

<bound method NDFrame.head of                                                    MainBranch Hobbyist  \
Respondent
1                      I am a student who is learning to code      Yes
2                      I am a student who is learning to code       No
3           I am not primarily a developer, but I write co...      Yes
4                              I am a developer by profession       No
5                              I am a developer by profession      Yes
...                                                       ...      ...
88377                                                     NaN      Yes
88601                                                     NaN       No
88802                                                     NaN       No
88816                                                     NaN       No
88863                                                     NaN      Yes

                                                  OpenSourcer  \
Respondent
1                                                       Never
2                                     Less than once per year
3                                                       Never
4                                                       Never
5                                  Once a month or more often
...                                                       ...
88377       Less than once a month but more than once per ...
88601                                                   Never
88802                                                   Never
88816                                                   Never
88863                                 Less than once per year

                                                   OpenSource  \
Respondent
1           The quality of OSS and closed source software ...
2           The quality of OSS and closed source software ...
3           The quality of OSS and closed source software ...
4           The quality of OSS and closed source software ...
5           OSS is, on average, of HIGHER quality than pro...
...                                                       ...
88377       The quality of OSS and closed source software ...
88601       The quality of OSS and closed source software ...
88802                                                     NaN
88816       OSS is, on average, of HIGHER quality than pro...
88863       OSS is, on average, of HIGHER quality than pro...

                                                   Employment  \
Respondent
1                      Not employed, and not looking for work
2                          Not employed, but looking for work
3                                          Employed full-time
4                                          Employed full-time
5                                          Employed full-time
...                                                       ...
88377                  Not employed, and not looking for work
88601                                                     NaN
88802                                      Employed full-time
88816       Independent contractor, freelancer, or self-em...
88863                  Not employed, and not looking for work

                           Country         Student  \
Respondent
1                   United Kingdom              No
2           Bosnia and Herzegovina  Yes, full-time
3                         Thailand              No
4                    United States              No
5                          Ukraine              No
...                            ...             ...
88377                       Canada              No
88601                          NaN             NaN
88802                          NaN             NaN
88816                          NaN             NaN
88863                        Spain  Yes, full-time

                                                      EdLevel  \
Respondent
1                                   Primary/elementary school
2           Secondary school (e.g. American high school, G...
3                    Bachelors degree (BA, BS, B.Eng., etc.)
4                    Bachelors degree (BA, BS, B.Eng., etc.)
5                    Bachelors degree (BA, BS, B.Eng., etc.)
...                                                       ...
88377                               Primary/elementary school
88601                                                     NaN
88802                                                     NaN
88816                                                     NaN
88863                      Professional degree (JD, MD, etc.)

                                               UndergradMajor  \
Respondent
1                                                         NaN
2                                                         NaN
3                               Web development or web design
4           Computer science, computer engineering, or sof...
5           Computer science, computer engineering, or sof...
...                                                       ...
88377                                                     NaN
88601                                                     NaN
88802                                                     NaN
88816                                                     NaN
88863       Computer science, computer engineering, or sof...

                                                     EduOther  ...  \
Respondent                                                     ...
1           Taught yourself a new language, framework, or ...  ...
2           Taken an online course in programming or softw...  ...
3           Taught yourself a new language, framework, or ...  ...
4           Taken an online course in programming or softw...  ...
5           Taken an online course in programming or softw...  ...
...                                                       ...  ...
88377       Taught yourself a new language, framework, or ...  ...
88601                                                     NaN  ...
88802                                                     NaN  ...
88816                                                     NaN  ...
88863       Taken an online course in programming or softw...  ...

                                       WelcomeChange  \
Respondent
1            Just as welcome now as I felt last year
2            Just as welcome now as I felt last year
3            Just as welcome now as I felt last year
4            Just as welcome now as I felt last year
5            Just as welcome now as I felt last year
...                                              ...
88377                                            NaN
88601                                            NaN
88802                                            NaN
88816                                            NaN
88863       Somewhat less welcome now than last year

                                                 SONewContent   Age Gender  \
Respondent
1           Tech articles written by other developers;Indu...  14.0    Man
2           Tech articles written by other developers;Indu...  19.0    Man
3           Tech meetups or events in your area;Courses on...  28.0    Man
4           Tech articles written by other developers;Indu...  22.0    Man
5           Tech meetups or events in your area;Courses on...  30.0    Man
...                                                       ...   ...    ...
88377       Tech articles written by other developers;Tech...   NaN    Man
88601                                                     NaN   NaN    NaN
88802                                                     NaN   NaN    NaN
88816                                                     NaN   NaN    NaN
88863       Tech articles written by other developers;Indu...  18.0    Man

           Trans                Sexuality  \
Respondent
1             No  Straight / Heterosexual
2             No  Straight / Heterosexual
3             No  Straight / Heterosexual
4             No  Straight / Heterosexual
5             No  Straight / Heterosexual
...          ...                      ...
88377         No                      NaN
88601        NaN                      NaN
88802        NaN                      NaN
88816        NaN                      NaN
88863         No  Straight / Heterosexual

                                                    Ethnicity Dependents  \
Respondent
1                                                         NaN         No
2                                                         NaN         No
3                                                         NaN        Yes
4                                White or of European descent         No
5                    White or of European descent;Multiracial         No
...                                                       ...        ...
88377                                                     NaN         No
88601                                                     NaN        NaN
88802                                                     NaN        NaN
88816                                                     NaN        NaN
88863       Hispanic or Latino/Latina;White or of European...         No

                     SurveyLength                  SurveyEase
Respondent
1           Appropriate in length  Neither easy nor difficult
2           Appropriate in length  Neither easy nor difficult
3           Appropriate in length  Neither easy nor difficult
4           Appropriate in length                        Easy
5           Appropriate in length                        Easy
...                           ...                         ...
88377       Appropriate in length                        Easy
88601                         NaN                         NaN
88802                         NaN                         NaN
88816                         NaN                         NaN
88863       Appropriate in length                        Easy

[88883 rows x 84 columns]>

In [88]:
df = df.rename(columns={'ConvertedComp', 'SalaryUSD'}, inplace=True)

TypeError: 'set' object is not callable

In [89]:
df['ConvertedComp']

Respondent
1            NaN
2            NaN
3         8820.0
4        61000.0
5            NaN
          ...
88377        NaN
88601        NaN
88802        NaN
88816        NaN
88863        NaN
Name: ConvertedComp, Length: 88883, dtype: float64

In [91]:
df['Hobbyist']

Respondent
1        Yes
2         No
3        Yes
4         No
5        Yes
        ...
88377    Yes
88601     No
88802     No
88816     No
88863    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [92]:
df['Hobbyist'].map({'Yes':True, 'No': False})

Respondent
1         True
2        False
3         True
4        False
5         True
         ...
88377     True
88601    False
88802    False
88816    False
88863     True
Name: Hobbyist, Length: 88883, dtype: bool

In [93]:
df['Hobbyist']

Respondent
1        Yes
2         No
3        Yes
4         No
5        Yes
        ...
88377    Yes
88601     No
88802     No
88816     No
88863    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [94]:
df['Hobbyist']=df['Hobbyist'].map({'Yes':True, 'No': False})

In [ ]:
#adding/ remove rows and columns

In [5]:
df = pd.DataFrame(employee)

In [6]:
df

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3  Ramesh  c@x.com

In [7]:
df['name'] + '_' + df['email']

0     Nitin_a@x.com
1    Gautam_b@x.com
2    Ramesh_c@x.com
dtype: object

In [8]:
df['new_field'] = df['name'] + '_' + df['email']

In [9]:
df

   id    name    email       new_field
0   1   Nitin  a@x.com   Nitin_a@x.com
1   2  Gautam  b@x.com  Gautam_b@x.com
2   3  Ramesh  c@x.com  Ramesh_c@x.com

In [10]:
#remove column

In [11]:
df.drop(columns=['new_field'])

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3  Ramesh  c@x.com

In [14]:
#just gives us a view
df

   id    name    email       new_field
0   1   Nitin  a@x.com   Nitin_a@x.com
1   2  Gautam  b@x.com  Gautam_b@x.com
2   3  Ramesh  c@x.com  Ramesh_c@x.com

In [15]:
#drop permanently
df.drop(columns=['new_field'], inplace=True)

In [16]:
df

   id    name    email
0   1   Nitin  a@x.com
1   2  Gautam  b@x.com
2   3  Ramesh  c@x.com

In [17]:
df['email'].str.split('@')

0    [a, x.com]
1    [b, x.com]
2    [c, x.com]
Name: email, dtype: object

In [18]:
df['email'].str.split('@', expand=True)

   0      1
0  a  x.com
1  b  x.com
2  c  x.com

In [19]:
df[['first_col', 'last_col']]=df['email'].str.split('@', expand=True)

In [20]:
df

   id    name    email first_col last_col
0   1   Nitin  a@x.com         a    x.com
1   2  Gautam  b@x.com         b    x.com
2   3  Ramesh  c@x.com         c    x.com

In [21]:
#add a single row
row = {'id':4, 'name': 'Sumit', 'email': 's@x.com', 'first_col':'s', 'last_col':'x.com'}

df.append(row)

C:\Users\Nitin Gautam\AppData\Local\Temp\ipykernel_17508\1674243750.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(row)

TypeError: Can only append a dict if ignore_index=True

In [22]:
row = {'id':4, 'name': 'Sumit', 'email': 's@x.com', 'first_col':'s', 'last_col':'x.com'}

df.append(row, ignore_index=True)

C:\Users\Nitin Gautam\AppData\Local\Temp\ipykernel_17508\1520964327.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(row, ignore_index=True)

   id    name    email first_col last_col
0   1   Nitin  a@x.com         a    x.com
1   2  Gautam  b@x.com         b    x.com
2   3  Ramesh  c@x.com         c    x.com
3   4   Sumit  s@x.com         s    x.com

In [24]:
employee_new = {
    'id':[5, 6],
    'name':['Sachin', 'Gau'],
    'email':['s@x.com', 'g@x.com']   
}

In [25]:
df_new = pd.DataFrame(employee_new)

In [26]:
df_new

   id    name    email
0   5  Sachin  s@x.com
1   6     Gau  g@x.com

In [28]:
df.append(df_new, ignore_index=True)

C:\Users\Nitin Gautam\AppData\Local\Temp\ipykernel_17508\2882132393.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df_new, ignore_index=True)

   id    name    email first_col last_col
0   1   Nitin  a@x.com         a    x.com
1   2  Gautam  b@x.com         b    x.com
2   3  Ramesh  c@x.com         c    x.com
3   5  Sachin  s@x.com       NaN      NaN
4   6     Gau  g@x.com       NaN      NaN

In [32]:
df.drop(index=3)

KeyError: '[3] not found in axis'

In [33]:
df

   id    name    email first_col last_col
0   1   Nitin  a@x.com         a    x.com
1   2  Gautam  b@x.com         b    x.com
2   3  Ramesh  c@x.com         c    x.com

In [36]:
df.drop(index=df[df['first_col']=='c'].index)

   id    name    email first_col last_col
0   1   Nitin  a@x.com         a    x.com
1   2  Gautam  b@x.com         b    x.com